Tinyu-Zhao/Arduino-Boards/boards.txt
m5stack-atom.menu.PartitionScheme.default=Default
m5stack-atom.menu.PartitionScheme.default.build.partitions=default
m5stack-atom.menu.PartitionScheme.no_ota=No OTA (Large APP)
m5stack-atom.menu.PartitionScheme.no_ota.build.partitions=no_ota
m5stack-atom.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
m5stack-atom.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
m5stack-atom.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
m5stack-atom.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

m5stack-atom.menu.UploadSpeed.1500000=1500000
m5stack-atom.menu.UploadSpeed.1500000.upload.speed=1500000
m5stack-atom.menu.UploadSpeed.750000=750000
m5stack-atom.menu.UploadSpeed.750000.upload.speed=750000
m5stack-atom.menu.UploadSpeed.500000=500000
m5stack-atom.menu.UploadSpeed.500000.upload.speed=500000
m5stack-atom.menu.UploadSpeed.250000=250000
m5stack-atom.menu.UploadSpeed.250000.upload.speed=250000
m5stack-atom.menu.UploadSpeed.115200=115200
m5stack-atom.menu.UploadSpeed.115200.upload.speed=115200

m5stack-atom.menu.DebugLevel.none=None
m5stack-atom.menu.DebugLevel.none.build.code_debug=0
m5stack-atom.menu.DebugLevel.error=Error
m5stack-atom.menu.DebugLevel.error.build.code_debug=1
m5stack-atom.menu.DebugLevel.warn=Warn
m5stack-atom.menu.DebugLevel.warn.build.code_debug=2
m5stack-atom.menu.DebugLevel.info=Info
m5stack-atom.menu.DebugLevel.info.build.code_debug=3
m5stack-atom.menu.DebugLevel.debug=Debug
m5stack-atom.menu.DebugLevel.debug.build.code_debug=4
m5stack-atom.menu.DebugLevel.verbose=Verbose
m5stack-atom.menu.DebugLevel.verbose.build.code_debug=5

m5stack-atom.menu.EraseFlash.none=Disabled
m5stack-atom.menu.EraseFlash.none.upload.erase_cmd=
m5stack-atom.menu.EraseFlash.all=Enabled
m5stack-atom.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

m5stack-atoms3.name=M5Stack-ATOMS3
m5stack-atoms3.vid.0=0x303a
m5stack-atoms3.pid.0=0x1001

m5stack-atoms3.bootloader.tool=esptool_py
m5stack-atoms3.bootloader.tool.default=esptool_py

m5stack-atoms3.upload.tool=esptool_py
m5stack-atoms3.upload.tool.default=esptool_py
m5stack-atoms3.upload.tool.network=esp_ota

m5stack-atoms3.upload.maximum_size=1310720
m5stack-atoms3.upload.maximum_data_size=327680
m5stack-atoms3.upload.flags=
m5stack-atoms3.upload.extra_flags=
m5stack-atoms3.upload.use_1200bps_touch=false
m5stack-atoms3.upload.wait_for_upload_port=false

m5stack-atoms3.serial.disableDTR=false
m5stack-atoms3.serial.disableRTS=false

m5stack-atoms3.build.tarch=xtensa
m5stack-atoms3.build.bootloader_addr=0x0
m5stack-atoms3.build.target=esp32s3
m5stack-atoms3.build.mcu=esp32s3
m5stack-atoms3.build.core=esp32
m5stack-atoms3.build.variant=m5stack_atoms3
m5stack-atoms3.build.board=M5Stack_ATOMS3

m5stack-atoms3.build.usb_mode=1
m5stack-atoms3.build.cdc_on_boot=0
m5stack-atoms3.build.msc_on_boot=0
m5stack-atoms3.build.dfu_on_boot=0
m5stack-atoms3.build.f_cpu=240000000L
m5stack-atoms3.build.flash_size=4MB
m5stack-atoms3.build.flash_freq=80m
m5stack-atoms3.build.flash_mode=dio
m5stack-atoms3.build.boot=qio
m5stack-atoms3.build.boot_freq=80m
m5stack-atoms3.build.partitions=default
m5stack-atoms3.build.defines=
m5stack-atoms3.build.loop_core=
m5stack-atoms3.build.event_core=
m5stack-atoms3.build.psram_type=qspi
m5stack-atoms3.build.memory_type={build.boot}_{build.psram_type}

m5stack-atoms3.menu.JTAGAdapter.default=Disabled
m5stack-atoms3.menu.JTAGAdapter.default.build.copy_jtag_files=0
m5stack-atoms3.menu.JTAGAdapter.builtin=Integrated USB JTAG
m5stack-atoms3.menu.JTAGAdapter.builtin.build.openocdscript=esp32s3-builtin.cfg
m5stack-atoms3.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
m5stack-atoms3.menu.JTAGAdapter.external=FTDI Adapter
m5stack-atoms3.menu.JTAGAdapter.external.build.openocdscript=esp32s3-ftdi.cfg
m5stack-atoms3.menu.JTAGAdapter.external.build.copy_jtag_files=1
m5stack-atoms3.menu.JTAGAdapter.bridge=ESP USB Bridge
m5stack-atoms3.menu.JTAGAdapter.bridge.build.openocdscript=esp32s3-bridge.cfg
m5stack-atoms3.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

m5stack-atoms3.menu.PSRAM.disabled=Disabled
m5stack-atoms3.menu.PSRAM.disabled.build.defines=
m5stack-atoms3.menu.PSRAM.disabled.build.psram_type=qspi
m5stack-atoms3.menu.PSRAM.enabled=QSPI PSRAM
m5stack-atoms3.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
m5stack-atoms3.menu.PSRAM.enabled.build.psram_type=qspi
m5stack-atoms3.menu.PSRAM.opi=OPI PSRAM
m5stack-atoms3.menu.PSRAM.opi.build.defines=-DBOARD_HAS_PSRAM
m5stack-atoms3.menu.PSRAM.opi.build.psram_type=opi

m5stack-atoms3.menu.FlashMode.qio=QIO 80MHz
m5stack-atoms3.menu.FlashMode.qio.build.flash_mode=dio
m5stack-atoms3.menu.FlashMode.qio.build.boot=qio
m5stack-atoms3.menu.FlashMode.qio.build.boot_freq=80m
m5stack-atoms3.menu.FlashMode.qio.build.flash_freq=80m
m5stack-atoms3.menu.FlashMode.qio120=QIO 120MHz
m5stack-atoms3.menu.FlashMode.qio120.build.flash_mode=dio
m5stack-atoms3.menu.FlashMode.qio120.build.boot=qio
m5stack-atoms3.menu.FlashMode.qio120.build.boot_freq=120m
m5stack-atoms3.menu.FlashMode.qio120.build.flash_freq=80m
m5stack-atoms3.menu.FlashMode.dio=DIO 80MHz
m5stack-atoms3.menu.FlashMode.dio.build.flash_mode=dio
m5stack-atoms3.menu.FlashMode.dio.build.boot=dio
m5stack-atoms3.menu.FlashMode.dio.build.boot_freq=80m
m5stack-atoms3.menu.FlashMode.dio.build.flash_freq=80m
m5stack-atoms3.menu.FlashMode.opi=OPI 80MHz
m5stack-atoms3.menu.FlashMode.opi.build.flash_mode=dout
m5stack-atoms3.menu.FlashMode.opi.build.boot=opi
m5stack-atoms3.menu.FlashMode.opi.build.boot_freq=80m
m5stack-atoms3.menu.FlashMode.opi.build.flash_freq=80m

m5stack-atoms3.menu.FlashSize.4M=4MB (32Mb)
m5stack-atoms3.menu.FlashSize.4M.build.flash_size=4MB
m5stack-atoms3.menu.FlashSize.8M=8MB (64Mb)
m5stack-atoms3.menu.FlashSize.8M.build.flash_size=8MB
m5stack-atoms3.menu.FlashSize.8M.build.partitions=default_8MB
m5stack-atoms3.menu.FlashSize.16M=16MB (128Mb)
m5stack-atoms3.menu.FlashSize.16M.build.flash_size=16MB
#m5stack-atoms3.menu.FlashSize.32M=32MB (256Mb)
#m5stack-atoms3.menu.FlashSize.32M.build.flash_size=32MB

m5stack-atoms3.menu.LoopCore.1=Core 1
m5stack-atoms3.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
m5stack-atoms3.menu.LoopCore.0=Core 0
m5stack-atoms3.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

