Tinyu-Zhao/Arduino-Boards/boards.txt
m5stack-atoms3.menu.EventsCore.1=Core 1
m5stack-atoms3.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
m5stack-atoms3.menu.EventsCore.0=Core 0
m5stack-atoms3.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

m5stack-atoms3.menu.USBMode.hwcdc=Hardware CDC and JTAG
m5stack-atoms3.menu.USBMode.hwcdc.build.usb_mode=1
m5stack-atoms3.menu.USBMode.default=USB-OTG (TinyUSB)
m5stack-atoms3.menu.USBMode.default.build.usb_mode=0

m5stack-atoms3.menu.CDCOnBoot.default=Disabled
m5stack-atoms3.menu.CDCOnBoot.default.build.cdc_on_boot=0
m5stack-atoms3.menu.CDCOnBoot.cdc=Enabled
m5stack-atoms3.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

m5stack-atoms3.menu.MSCOnBoot.default=Disabled
m5stack-atoms3.menu.MSCOnBoot.default.build.msc_on_boot=0
m5stack-atoms3.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
m5stack-atoms3.menu.MSCOnBoot.msc.build.msc_on_boot=1

m5stack-atoms3.menu.DFUOnBoot.default=Disabled
m5stack-atoms3.menu.DFUOnBoot.default.build.dfu_on_boot=0
m5stack-atoms3.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
m5stack-atoms3.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

m5stack-atoms3.menu.UploadMode.default=UART0 / Hardware CDC
m5stack-atoms3.menu.UploadMode.default.upload.use_1200bps_touch=false
m5stack-atoms3.menu.UploadMode.default.upload.wait_for_upload_port=false
m5stack-atoms3.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
m5stack-atoms3.menu.UploadMode.cdc.upload.use_1200bps_touch=true
m5stack-atoms3.menu.UploadMode.cdc.upload.wait_for_upload_port=true

m5stack-atoms3.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
m5stack-atoms3.menu.PartitionScheme.default.build.partitions=default
m5stack-atoms3.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
m5stack-atoms3.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
m5stack-atoms3.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
m5stack-atoms3.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
m5stack-atoms3.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336

m5stack-atoms3.menu.CPUFreq.240=240MHz (WiFi)
m5stack-atoms3.menu.CPUFreq.240.build.f_cpu=240000000L
m5stack-atoms3.menu.CPUFreq.160=160MHz (WiFi)
m5stack-atoms3.menu.CPUFreq.160.build.f_cpu=160000000L
m5stack-atoms3.menu.CPUFreq.80=80MHz (WiFi)
m5stack-atoms3.menu.CPUFreq.80.build.f_cpu=80000000L
m5stack-atoms3.menu.CPUFreq.40=40MHz
m5stack-atoms3.menu.CPUFreq.40.build.f_cpu=40000000L
m5stack-atoms3.menu.CPUFreq.20=20MHz
m5stack-atoms3.menu.CPUFreq.20.build.f_cpu=20000000L
m5stack-atoms3.menu.CPUFreq.10=10MHz
m5stack-atoms3.menu.CPUFreq.10.build.f_cpu=10000000L

m5stack-atoms3.menu.UploadSpeed.921600=921600
m5stack-atoms3.menu.UploadSpeed.921600.upload.speed=921600
m5stack-atoms3.menu.UploadSpeed.115200=115200
m5stack-atoms3.menu.UploadSpeed.115200.upload.speed=115200
m5stack-atoms3.menu.UploadSpeed.256000.windows=256000
m5stack-atoms3.menu.UploadSpeed.256000.upload.speed=256000
m5stack-atoms3.menu.UploadSpeed.230400.windows.upload.speed=256000
m5stack-atoms3.menu.UploadSpeed.230400=230400
m5stack-atoms3.menu.UploadSpeed.230400.upload.speed=230400
m5stack-atoms3.menu.UploadSpeed.460800.linux=460800
m5stack-atoms3.menu.UploadSpeed.460800.macosx=460800
m5stack-atoms3.menu.UploadSpeed.460800.upload.speed=460800
m5stack-atoms3.menu.UploadSpeed.512000.windows=512000
m5stack-atoms3.menu.UploadSpeed.512000.upload.speed=512000

m5stack-atoms3.menu.DebugLevel.none=None
m5stack-atoms3.menu.DebugLevel.none.build.code_debug=0
m5stack-atoms3.menu.DebugLevel.error=Error
m5stack-atoms3.menu.DebugLevel.error.build.code_debug=1
m5stack-atoms3.menu.DebugLevel.warn=Warn
m5stack-atoms3.menu.DebugLevel.warn.build.code_debug=2
m5stack-atoms3.menu.DebugLevel.info=Info
m5stack-atoms3.menu.DebugLevel.info.build.code_debug=3
m5stack-atoms3.menu.DebugLevel.debug=Debug
m5stack-atoms3.menu.DebugLevel.debug.build.code_debug=4
m5stack-atoms3.menu.DebugLevel.verbose=Verbose
m5stack-atoms3.menu.DebugLevel.verbose.build.code_debug=5

m5stack-atoms3.menu.EraseFlash.none=Disabled
m5stack-atoms3.menu.EraseFlash.none.upload.erase_cmd=
m5stack-atoms3.menu.EraseFlash.all=Enabled
m5stack-atoms3.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

m5stack-core2.name=M5Stack-Core2

m5stack-core2.bootloader.tool=esptool_py
m5stack-core2.bootloader.tool.default=esptool_py

m5stack-core2.upload.tool=esptool_py
m5stack-core2.upload.tool.default=esptool_py
m5stack-core2.upload.tool.network=esp_ota

m5stack-core2.upload.maximum_size=6553600
m5stack-core2.upload.maximum_data_size=4521984
m5stack-core2.upload.flags=
m5stack-core2.upload.extra_flags=
m5stack-core2.upload.use_1200bps_touch=false
m5stack-core2.upload.wait_for_upload_port=false

m5stack-core2.serial.disableDTR=true
m5stack-core2.serial.disableRTS=true

m5stack-core2.build.tarch=xtensa
m5stack-core2.build.bootloader_addr=0x1000
m5stack-core2.build.target=esp32
m5stack-core2.build.mcu=esp32
m5stack-core2.build.core=esp32
m5stack-core2.build.variant=m5stack_core2
m5stack-core2.build.board=M5STACK_Core2

m5stack-core2.build.f_cpu=240000000L
m5stack-core2.build.flash_size=16MB
m5stack-core2.build.flash_freq=80m
m5stack-core2.build.flash_mode=dio
m5stack-core2.build.boot=dio
m5stack-core2.build.partitions=default_16MB
m5stack-core2.build.defines=

m5stack-core2.menu.PSRAM.enabled=Enabled
m5stack-core2.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
m5stack-core2.menu.PSRAM.enabled.build.extra_libs=
m5stack-core2.menu.PSRAM.disabled=Disabled
m5stack-core2.menu.PSRAM.disabled.build.defines=
m5stack-core2.menu.PSRAM.disabled.build.extra_libs=

m5stack-core2.menu.PartitionScheme.default=Default (2 x 6.5 MB app, 3.6 MB SPIFFS)
m5stack-core2.menu.PartitionScheme.default.build.partitions=default_16MB
m5stack-core2.menu.PartitionScheme.default.upload.maximum_size=6553600
m5stack-core2.menu.PartitionScheme.large_spiffs=Large SPIFFS (7 MB)
m5stack-core2.menu.PartitionScheme.large_spiffs.build.partitions=large_spiffs_16MB
m5stack-core2.menu.PartitionScheme.large_spiffs.upload.maximum_size=4685824

m5stack-core2.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
m5stack-core2.menu.PartitionScheme.minimal.build.partitions=minimal
m5stack-core2.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
m5stack-core2.menu.PartitionScheme.no_ota.build.partitions=no_ota
m5stack-core2.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
m5stack-core2.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
m5stack-core2.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
m5stack-core2.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
m5stack-core2.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
m5stack-core2.menu.PartitionScheme.huge_app.build.partitions=huge_app
m5stack-core2.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
m5stack-core2.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
m5stack-core2.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
m5stack-core2.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

m5stack-core2.menu.CPUFreq.240=240MHz (WiFi/BT)
m5stack-core2.menu.CPUFreq.240.build.f_cpu=240000000L
m5stack-core2.menu.CPUFreq.160=160MHz (WiFi/BT)
m5stack-core2.menu.CPUFreq.160.build.f_cpu=160000000L
m5stack-core2.menu.CPUFreq.80=80MHz (WiFi/BT)
m5stack-core2.menu.CPUFreq.80.build.f_cpu=80000000L
m5stack-core2.menu.CPUFreq.40=40MHz (40MHz XTAL)
m5stack-core2.menu.CPUFreq.40.build.f_cpu=40000000L
m5stack-core2.menu.CPUFreq.26=26MHz (26MHz XTAL)
m5stack-core2.menu.CPUFreq.26.build.f_cpu=26000000L
m5stack-core2.menu.CPUFreq.20=20MHz (40MHz XTAL)
m5stack-core2.menu.CPUFreq.20.build.f_cpu=20000000L
m5stack-core2.menu.CPUFreq.13=13MHz (26MHz XTAL)
m5stack-core2.menu.CPUFreq.13.build.f_cpu=13000000L
m5stack-core2.menu.CPUFreq.10=10MHz (40MHz XTAL)
m5stack-core2.menu.CPUFreq.10.build.f_cpu=10000000L

